/* Задача 1: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа. 
   Обязательна проверка на ввод чисел больше/меньше 3-х знаков

456 -> 5
782 ->  8
918  -> 1 */







/* Задача 2: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет. 
Берем числа до 100000

645 -> 5
78 -> третьей цифры нет
32679 -> 6 */









/* Задача 3: Напишите программу, которая принимает на вход цифру, обозначающую день недели, 
   и проверяет, является ли этот день выходным.  Обязательна проверка на ввод числа <1 и >7

6 -> да
7 ->  да
1 -> нет */